%сигнал из лр №1
clear
close all
U1 = 5;
U2 = 9;
U3 = 13;
U4 = 20;
T1 = 0.02;
T2 = 0.04;
Fd = 5000;
%график дискретизированного сигнала
%вектор отсчетов
counts = (0:1/Fd:T2);
u1 = counts(1:100)*(U2-U1)/T1+U1;
u2 = (U3+U2)/2;
b3 = (U4-(U4-U3)/(T2-T1)*counts(200));
u3 = counts(101:200)*(U4-U3)/(T2-T1)+b3;
x = [u1,u2,u3];
figure
stem(x);
%векторы коэффициентов фильтра (сгенерируем с помощью функции butter для частоты среза 0.1)
[b1,a1]=butter(4,0.1);
%Пропускание сигнала через дискретный фильтр
%добавление нулевых отсчетов в конец вектора для наблюдения затухающих
%переходных процессов
x0 = [x, zeros(1,length(x))];
%Выходной сигнал фильтра:
y = filter(b1, a1, x0);
figure
stem(y);
%Анализ прямой формы реализации дискретного фильтра
%максимальное по модулю внутреннее состояние (из входных и полученных выходных
%отсчетов):
max_x = max(abs(x0));
max_y = max(abs(y));
max_x_y = max(max_x, max_y);  % 20
%Анализ канонической формы реализации дискретного фильтра
b2 = [1,0,0,0,0];
y_kanon = filter(b2,a1,x0);
figure
stem(y_kanon);
max_y_kanon = max(abs(y_kanon)); % 2934
%Анализ транспонированной формы 
states = [];
s = [];
for k = 1:length(x0)
    [y, s] = filter(b1,a1,x0(k),s);
    states = [states s];
end
%транспонируем матрицу, чтобы plot строил графики внутренних сигналов (по
%столбцам)
figure
plot(states');
%максимальное по модулю внутреннее состояние
A_max = max(max(states));
%получение аналитической формулы импульсной х-ки
[r, p, k] = residuez(b1,a1);
%Модули и фазы вычетов и полюсов
r_abs = abs(r);
r_angle = angle(r);
p_abs = abs(p);
p_angle = angle(p);



